Конфигурация/Documents/Долг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>Долг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОперацииДолг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизит1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/Долг/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Долги.Очистить();
	Движения.Долги.Записывать = Истина;
	Движение             = Движения.Долги.Добавить();
	Если ВидОперации = Перечисления.ВидОперацииДолг.ЯВзялВДолг Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сумма       = Сумма;
	ИначеЕсли ВидОперации = Перечисления.ВидОперацииДолг.ЯВернулДолг Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сумма       = Сумма;
	ИначеЕсли ВидОперации = Перечисления.ВидОперацииДолг.УМеняВзялиВДолг Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сумма       = -Сумма;
	ИначеЕсли ВидОперации = Перечисления.ВидОперацииДолг.МнеВернулиДолг Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сумма       = -Сумма;
	КонецЕсли;
	Движение.Период      = Дата;
	Движение.Контрагент  = Контрагент;
	Движение.Валюта      = Валюта;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Валюта = Константы.ОсновнаяВалюта.Получить();
	КонецЕсли;	
КонецПроцедуры
